---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataRange
source: html/d39eda38-411e-e8d4-8c2a-c031e89306fc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataRange Property

"Product Range"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataRange { get; }
```